NextFOAM-2606/tutorials/lagrangian/reactingParcelFoam/verticalChannel/Allrun-parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication potentialFoam

runApplication decomposePar

runParallel $(getApplication)

#------------------------------------------------------------------------------
